strive/app/controllers/users_controller.rb

  def update
    # byebug
    @user = User.find_by(id: params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", " harry"], ["updated_at", "2018-09-14 23:09:50.633307"], ["id", 4]]

  def destroy
    @user = User.find_by(id: params[:id])
    @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 441], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 441]]